export const jsQuizz = {
  bel: [
    {
      question: "На кой ред думите са синоними?",
      choices: [
        "пестелив, щедър",
        "гневен, яростен",
        "малък, огромен",
        "умен, отзивчив",
      ],
      correctAnswer: "гневен, яростен",
    },
    {
      question: "На кой ред думите са антоними?",
      choices: [
        "спокоен, уравновесен",
        "замислен, вглъбен",
        "сърцат, сърдечен",
        "смел, малодушен",
      ],
      correctAnswer: "смел, малодушен",
    },
    {
      question: "Коя от думите е сродна на думата водя?",
      choices: [
        "предводител",
        "водоем",
        "наводнение",
        "воднист",
      ],
      correctAnswer: "предводител",
    },
    {
      question: "В кое изречение е употребена глаголна форма за минало свършено време?",
      choices: [
        "Всички се молеха за хубаво време.",
        "На разсъмване тръгнаха към върха.",
        "Туристите търсеха свободни стаи.",
        "Всички свиреха с въодушевление.",
      ],
      correctAnswer: "На разсъмване тръгнаха към върха.",
    },
    {
      question: "В кое изречение е употребена глаголна форма за минало несвършено време?",
      choices: [
        "Той сигурно няма да дойде на концерта.",
        "Тя разхождаше кученцето в градинката.",
        "Всяко лято през юли заминаваме на море.",
        "Случката разсмя всички мои приятели.",
      ],
      correctAnswer: "Тя разхождаше кученцето в градинката.",
    },
    {
      question: "В кое изречение е употребена глаголна форма за бъдеще време?",
      choices: [
        "Утре сутрин отивам на зъболекар.",
        "Няма да дойдат на тренировката.",
        "Делегацията пристига довечера.",
        "След малко тръгвам към гарата.",
      ],
      correctAnswer: "Няма да дойдат на тренировката.",
    },
    {
      question: "На кой ред думата е НЕПРАВИЛНО написана?",
      choices: [
        "вързвам",
        "дърпам",
        "бъркам",
        "мърдам",
      ],
      correctAnswer: "вързвам",
    },
    {
      question: "В кое изречение думата път е подлог?",
      choices: [
        "След малко излязохме на тесен коларски път.",
        "Между дърветата видяхме тесен коларски път.",
        "Пред очите ни се белееше тесен коларски път.",
        "Вървяхме почти част по тесния коларски път.",
      ],
      correctAnswer: "Пред очите ни се белееше тесен коларски път.",
    },
    {
      question: "В кое изречение има определение?",
      choices: [
        "Вървяхме бавно покрай брега.",
        "Стигнахме до брега на морето.",
        "Брегът се губеше зад скалата.",
        "Слънцето огряваше брега.",
      ],
      correctAnswer: "Стигнахме до брега на морето.",
    },
    {
      question: "В кое изречение е допусната грешка при членуване?",
      choices: [
        "Най-добрият състезател получи специална награда.",
        "Нашият отбор се гордее със своя най-добър състезател.",
        "Това е най-добрия състезател от нашия отбор.",
        "За нашия отбор е чест да има такъв добър състезател.",
      ],
      correctAnswer: "Това е най-добрия състезател от нашия отбор.",
    },
    {
      question: "В кое изречение е употребено минало свършено деятелно причастие?",
      choices: [
        "Девойката пеела чудна песен.",
        "Момчето мечтаело да стане моряк.",
        "Звездата светнала над планината.",
        "По цял ден мислел за нея.",
      ],
      correctAnswer: "Звездата светнала над планината.",
    },
    {
      question: "На кой ред думата е НЕПРАВИЛНО написана?",
      choices: [
        "малак",
        "къдрав",
        "гъвкав",
        "казал",
      ],
      correctAnswer: "малак",
    },
    {
      question: "На кой ред думата е НЕПРАВИЛНО написана?",
      choices: [
        "влязъл",
        "здание",
        "могъл",
        "покойте",
      ],
      correctAnswer: "покойте",
    },
    {
      question: "На кой ред думата е НЕПРАВИЛНО написана?",
      choices: [
        "искренност",
        "здание",
        "очакваше",
        "истината",
      ],
      correctAnswer: "искренност",
    },
    {
      question: "В коя от думите има правописна грешка?",
      choices: [
        "далечен",
        "патека",
        "мълча",
        "гадая",
      ],
      correctAnswer: "патека",
    },
    {
      question: "В коя от думите има правописна грешка?",
      choices: [
        "глухарче",
        "другар",
        "смотен",
        "изморен",
      ],
      correctAnswer: "смотен",
    },
    {
      question: "В коя от думите има правописна грешка?",
      choices: [
        "убида",
        "упреквам",
        "умножавам",
        "умора",
      ],
      correctAnswer: "убида",
    },
    {
      question: "В коя от думите има правописна грешка?",
      choices: [
        "потоп",
        "чорап",
        "сироп",
        "корап",
      ],
      correctAnswer: "корап",
    },
    {
      question: "Коя от думите е съществително име?",
      choices: [
        "цвете",
        "цветен",
        "оцветявам",
        "цветно",
      ],
      correctAnswer: "цвете",
    },
    {
      question: "Коя от думите е прилагателно име?",
      choices: [
        "украсявам",
        "красота",
        "красив",
        "красавица",
      ],
      correctAnswer: "красив",
    },
    {
      question: "Коя от думите е глагол?",
      choices: [
        "бегач",
        "бягане",
        "беглец",
        "бягам",
      ],
      correctAnswer: "бягам",
    },
    {
      question: "Коя от думите е числително редно име?",
      choices: [
        "първенец",
        "първи",
        "първенство",
        "един",
      ],
      correctAnswer: "първи",
    },
    {
      question: "В кое от изреченията думата бързо е наречие?",
      choices: [
        "Това дете е бързо.",
        "То тича бързо.",
        "В гората шумоли бързо поточе.",
        "Той има най-бързото куче.",
      ],
      correctAnswer: "То тича бързо.",
    },
    {
      question: "Коя от думите НЕ е синоним на останалите?",
      choices: [
        "храбър",
        "смел",
        "добър",
        "безстрашен",
      ],
      correctAnswer: "добър",
    },
    {
      question: "Коя от думите е без представка?",
      choices: [
        "слънце",
        "сграда",
        "свързвам",
        "сбор",
      ],
      correctAnswer: "слънце",
    },
    {
      question: "Коя от думите е без наставка?",
      choices: [
        "бързовар",
        "комар",
        "млекар",
        "гайдар",
      ],
      correctAnswer: "комар",
    },
    {
      question: "В кой ред глаголът пея е в минало свършено време?",
      choices: [
        "пея",
        "ще пея",
        "пях",
        "пеех",
      ],
      correctAnswer: "пях",
    },
    {
      question: "В кой ред глаголът играя е в минало несвършено време?",
      choices: [
        "играят",
        "ще играя",
        "играх",
        "играех",
      ],
      correctAnswer: "играех",
    },
  ],
  mat: [
    {
      question: "Кое от числата 7/3, 7/4, 7/7 и 7/8 е най-голямо?",
      choices: [
        "7/3",
        "7/4",
        "7/7",
        "7/8",
      ],
      correctAnswer: "7/3",
    },
    {
      question: "Кое от числата 5,41; 5,041; 5,401 и 5,0401 е най-малко?",
      choices: [
        "5,41",
        "5,041",
        "5,401",
        "5,0401",
      ],
      correctAnswer: "5,0401",
    },
    {
      question: "Разликата 3 1/4 – 2,2 е равна на:",
      choices: [
        "1,2",
        "1,05",
        "1",
        "0,94",
      ],
      correctAnswer: "1,05",
    },
    {
      question: "Произведението 4/7 * 0,35 е равно на:",
      choices: [
        "0,2",
        "4/5",
        "20",
        "2",
      ],
      correctAnswer: "0,2",
    },
    {
      question: "Лицето на успоредник със страна 15 m и височина към нея 48 dm е:",
      choices: [
        "720 кв.м",
        "72 кв.м",
        "36 кв.м",
        "7,2 кв.м",
      ],
      correctAnswer: "72 кв.м",
    },
    {
      question: "Ако x% от 48 е 9,6, x е равно на:",
      choices: [
        "0,2",
        "2",
        "20",
        "200",
      ],
      correctAnswer: "20",
    },
    {
      question: "Ако 3,6 : x = 3/5 * 1 1/2, то x е равно на:",
      choices: [
        "0,25",
        "0,4",
        "3,24",
        "4",
      ],
      correctAnswer: "4",
    },
    {
      question: "Ако 16,5 + x = 41,3 – 12,7, то x е равно на:",
      choices: [
        "121",
        "45,1",
        "37,5",
        "12,1",
      ],
      correctAnswer: "12,1",
    },
    {
      question: "Стойността на израза 4/7 * 2 1/3 – 1 1/3 : 2 2/3 е:",
      choices: [
        "3/14",
        "5/6",
        "1",
        "1 37/42",
      ],
      correctAnswer: "5/6",
    },
    {
      question: "Петцифреното число 24*25 се дели на 3, ако цифрата, скрита под *, е:",
      choices: [
        "0",
        "3",
        "4",
        "5",
      ],
      correctAnswer: "5",
    },
  ],

}

export const resultInitalState = {
  score: 0,
  correctAnswers: 0,
  wrongAnswers: 0,
};
